Revit 2024 API
DuctSizeIterator Class
 An iterator to a set of MEP duct sizes from DuctSizes.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DuctSizeIterator : IEnumerator<MEPSize>
Visual Basic
Public Class DuctSizeIterator _
	Implements IEnumerator(Of MEPSize)
Visual C++
public ref class DuctSizeIterator : IEnumerator<MEPSize^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizeIterator
See Also
DuctSizeIterator Members
Autodesk.Revit.DB.Mechanical Namespace